Model: "area_net"
______________________________________________________________________________________________________________________________________________________
Layer (type)                                     Output Shape                     Param #           Connected to                                      
======================================================================================================================================================
input_1 (InputLayer)                             [(None, 64, 32, 1)]              0                                                                   
______________________________________________________________________________________________________________________________________________________
conv2d (Conv2D)                                  (None, 64, 32, 20)               200               input_1[0][0]                                     
______________________________________________________________________________________________________________________________________________________
batch_normalization (BatchNormalization)         (None, 64, 32, 20)               80                conv2d[0][0]                                      
______________________________________________________________________________________________________________________________________________________
activation (Activation)                          (None, 64, 32, 20)               0                 batch_normalization[0][0]                         
______________________________________________________________________________________________________________________________________________________
conv2d_1 (Conv2D)                                (None, 64, 32, 20)               3620              activation[0][0]                                  
______________________________________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)       (None, 64, 32, 20)               80                conv2d_1[0][0]                                    
______________________________________________________________________________________________________________________________________________________
activation_1 (Activation)                        (None, 64, 32, 20)               0                 batch_normalization_1[0][0]                       
______________________________________________________________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)                     (None, 32, 32, 20)               0                 activation_1[0][0]                                
______________________________________________________________________________________________________________________________________________________
dropout (Dropout)                                (None, 32, 32, 20)               0                 max_pooling2d[0][0]                               
______________________________________________________________________________________________________________________________________________________
conv2d_2 (Conv2D)                                (None, 32, 32, 30)               5430              dropout[0][0]                                     
______________________________________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)       (None, 32, 32, 30)               120               conv2d_2[0][0]                                    
______________________________________________________________________________________________________________________________________________________
activation_2 (Activation)                        (None, 32, 32, 30)               0                 batch_normalization_2[0][0]                       
______________________________________________________________________________________________________________________________________________________
conv2d_3 (Conv2D)                                (None, 32, 32, 30)               8130              activation_2[0][0]                                
______________________________________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)       (None, 32, 32, 30)               120               conv2d_3[0][0]                                    
______________________________________________________________________________________________________________________________________________________
activation_3 (Activation)                        (None, 32, 32, 30)               0                 batch_normalization_3[0][0]                       
______________________________________________________________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)                   (None, 16, 16, 30)               0                 activation_3[0][0]                                
______________________________________________________________________________________________________________________________________________________
dropout_1 (Dropout)                              (None, 16, 16, 30)               0                 max_pooling2d_1[0][0]                             
______________________________________________________________________________________________________________________________________________________
conv2d_4 (Conv2D)                                (None, 16, 16, 40)               10840             dropout_1[0][0]                                   
______________________________________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)       (None, 16, 16, 40)               160               conv2d_4[0][0]                                    
______________________________________________________________________________________________________________________________________________________
activation_4 (Activation)                        (None, 16, 16, 40)               0                 batch_normalization_4[0][0]                       
______________________________________________________________________________________________________________________________________________________
conv2d_5 (Conv2D)                                (None, 16, 16, 40)               14440             activation_4[0][0]                                
______________________________________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalization)       (None, 16, 16, 40)               160               conv2d_5[0][0]                                    
______________________________________________________________________________________________________________________________________________________
activation_5 (Activation)                        (None, 16, 16, 40)               0                 batch_normalization_5[0][0]                       
______________________________________________________________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)                   (None, 8, 8, 40)                 0                 activation_5[0][0]                                
______________________________________________________________________________________________________________________________________________________
dropout_2 (Dropout)                              (None, 8, 8, 40)                 0                 max_pooling2d_2[0][0]                             
______________________________________________________________________________________________________________________________________________________
conv2d_6 (Conv2D)                                (None, 8, 8, 40)                 14440             dropout_2[0][0]                                   
______________________________________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalization)       (None, 8, 8, 40)                 160               conv2d_6[0][0]                                    
______________________________________________________________________________________________________________________________________________________
activation_6 (Activation)                        (None, 8, 8, 40)                 0                 batch_normalization_6[0][0]                       
______________________________________________________________________________________________________________________________________________________
conv2d_7 (Conv2D)                                (None, 8, 8, 80)                 28880             activation_6[0][0]                                
______________________________________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalization)       (None, 8, 8, 80)                 320               conv2d_7[0][0]                                    
______________________________________________________________________________________________________________________________________________________
activation_7 (Activation)                        (None, 8, 8, 80)                 0                 batch_normalization_7[0][0]                       
______________________________________________________________________________________________________________________________________________________
dropout_3 (Dropout)                              (None, 8, 8, 80)                 0                 activation_7[0][0]                                
______________________________________________________________________________________________________________________________________________________
area_values_small_mean_feat (Lambda)             (None, 8, 8, 1)                  0                 dropout_3[0][0]                                   
______________________________________________________________________________________________________________________________________________________
area_values_small_mean_freq (Lambda)             (None, 1, 8, 1)                  0                 area_values_small_mean_feat[0][0]                 
______________________________________________________________________________________________________________________________________________________
area_values_softmax (Lambda)                     (None, 1, 8, 1)                  0                 area_values_small_mean_freq[0][0]                 
______________________________________________________________________________________________________________________________________________________
area_values (UpSampling2D)                       (None, 64, 32, 1)                0                 area_values_softmax[0][0]                         
______________________________________________________________________________________________________________________________________________________
multiply (Multiply)                              (None, 64, 32, 1)                0                 area_values[0][0]                                 
                                                                                                    input_1[0][0]                                     
______________________________________________________________________________________________________________________________________________________
conv2d_8 (Conv2D)                                (None, 64, 32, 40)               400               multiply[0][0]                                    
______________________________________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalization)       (None, 64, 32, 40)               160               conv2d_8[0][0]                                    
______________________________________________________________________________________________________________________________________________________
activation_8 (Activation)                        (None, 64, 32, 40)               0                 batch_normalization_8[0][0]                       
______________________________________________________________________________________________________________________________________________________
conv2d_9 (Conv2D)                                (None, 64, 32, 40)               14440             activation_8[0][0]                                
______________________________________________________________________________________________________________________________________________________
batch_normalization_9 (BatchNormalization)       (None, 64, 32, 40)               160               conv2d_9[0][0]                                    
______________________________________________________________________________________________________________________________________________________
activation_9 (Activation)                        (None, 64, 32, 40)               0                 batch_normalization_9[0][0]                       
______________________________________________________________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)                   (None, 32, 16, 40)               0                 activation_9[0][0]                                
______________________________________________________________________________________________________________________________________________________
dropout_4 (Dropout)                              (None, 32, 16, 40)               0                 max_pooling2d_3[0][0]                             
______________________________________________________________________________________________________________________________________________________
conv2d_10 (Conv2D)                               (None, 32, 16, 80)               28880             dropout_4[0][0]                                   
______________________________________________________________________________________________________________________________________________________
batch_normalization_10 (BatchNormalization)      (None, 32, 16, 80)               320               conv2d_10[0][0]                                   
______________________________________________________________________________________________________________________________________________________
activation_10 (Activation)                       (None, 32, 16, 80)               0                 batch_normalization_10[0][0]                      
______________________________________________________________________________________________________________________________________________________
conv2d_11 (Conv2D)                               (None, 32, 16, 80)               57680             activation_10[0][0]                               
______________________________________________________________________________________________________________________________________________________
batch_normalization_11 (BatchNormalization)      (None, 32, 16, 80)               320               conv2d_11[0][0]                                   
______________________________________________________________________________________________________________________________________________________
activation_11 (Activation)                       (None, 32, 16, 80)               0                 batch_normalization_11[0][0]                      
______________________________________________________________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)                   (None, 16, 8, 80)                0                 activation_11[0][0]                               
______________________________________________________________________________________________________________________________________________________
dropout_5 (Dropout)                              (None, 16, 8, 80)                0                 max_pooling2d_4[0][0]                             
______________________________________________________________________________________________________________________________________________________
conv2d_12 (Conv2D)                               (None, 16, 8, 80)                57680             dropout_5[0][0]                                   
______________________________________________________________________________________________________________________________________________________
batch_normalization_12 (BatchNormalization)      (None, 16, 8, 80)                320               conv2d_12[0][0]                                   
______________________________________________________________________________________________________________________________________________________
activation_12 (Activation)                       (None, 16, 8, 80)                0                 batch_normalization_12[0][0]                      
______________________________________________________________________________________________________________________________________________________
conv2d_13 (Conv2D)                               (None, 16, 8, 160)               115360            activation_12[0][0]                               
______________________________________________________________________________________________________________________________________________________
batch_normalization_13 (BatchNormalization)      (None, 16, 8, 160)               640               conv2d_13[0][0]                                   
______________________________________________________________________________________________________________________________________________________
activation_13 (Activation)                       (None, 16, 8, 160)               0                 batch_normalization_13[0][0]                      
______________________________________________________________________________________________________________________________________________________
dropout_6 (Dropout)                              (None, 16, 8, 160)               0                 activation_13[0][0]                               
______________________________________________________________________________________________________________________________________________________
global_average_pooling2d (GlobalAveragePooling2D (None, 160)                      0                 dropout_6[0][0]                                   
______________________________________________________________________________________________________________________________________________________
dense (Dense)                                    (None, 37)                       5957              global_average_pooling2d[0][0]                    
______________________________________________________________________________________________________________________________________________________
output (Activation)                              (None, 37)                       0                 dense[0][0]                                       
======================================================================================================================================================
Total params: 369,497
Trainable params: 367,937
Non-trainable params: 1,560
______________________________________________________________________________________________________________________________________________________
